from flask import Flask, render_template, request, redirect, url_for
import random
from collections import Counter

app = Flask(__name__)            
questions = {
"q1": {
        "text": "Вам нравится работать с людьми?",
        "options": {"a": "Да", "b": "Нет", "c": "Иногда"},
        "professions": {
            "a": ["Учитель", "Врач", "Менеджер", "Психолог", "Социальный работник", "Юрист", "Актер"],
            "b": ["Программист", "Тестировщик", "Художник", "Композитор", "Киберспортсмен"],
            "c": ["Дизайнер", "Журналист", "Музыкант", "Переводчик", "Архитектор", "Политик", "Финансист"],
        }
    },
"q2": {
        "text": "Вам нравится выступать перед публикой?",
        "options": {"a": "Да", "b": "Нет", "c": "Иногда"},
        "professions": {
            "a": ["Актер", "Ведущий", "Публичный деятель", "Политик"],
            "b": ["Программист", "Писатель", "Бухгалтер", "Художник"],
            "c": ["Переводчик", "Аналитик", "Дизайнер", "Инженер"],
            }
        },
    "q3": {
        "text": "Что вам нравится делать в свободное время?",
        "options": {"a": "Проводить время с друзьями", "b": "Путешествовать", "c": "Играть в компьютерные игры"},
        "professions": {
        "a": ["Социальный работник", "Психолог", "Тренер", "Бармен"],
        "b": ["Гид", "Стюардесса", "Переводчик", "Журналист"],
        "c": ["Программист", "Разработчик", "Киберспортсмен", "Тестировщик"],
        }
    },
    "q4": {
        "text": "Насколько важна для вас заработная плата?",
        "options": {"a": "Очень важна", "b": "Не очень важна", "c": "Не важна"},
        "professions": {
        "a": ["Программист", "Аналитик", "Бизнесмен", "Директор", "Финансист", "Психолог", "Киберспортсмен", "Инвестор"],
        "b": ["Рабочий", "Учитель", "Музыкант", "Социальный работник", "Инструктор" "Врач", "Зоолог"],
        "c": ["Волонтер", "Официант", "Домохозяйка", "Оператор"],
        }
    },

    "q5": {
        "text": "Как вы относитесь к командировкам?",
        "options": {"a": "Нравится, люблю путешествовать", "b": "Нормально, если это не часто", "c": "Не люблю, стараюсь избежать", "d":"Не интересует",},
        "professions": {
        "a": ["Гид", "Директор", "Журналист", "Актер", "Инженер", "Специалист по продажам", "Специалист по международным отношениям", "Переводчик", "Стюардесса"],
        "b": ["Бухгалтер", "Юрист", "Врач"],
        "c": ["Архитектор", "Дизайнер", "Исследователь"],
        "d": ["Водитель", "Оператор", "Рабочий", "Кассир", "Тестировщик", "Киберспортсмен"],
        }
    },

    "q6": {
        "text": "Насколько вы пунктуальны?",
        "options": {"a": "Очень", "b": "Достаточно", "c": "Средне", "d": "Не очень"},
        "professions": {
        "a": ["Учитель", "Директор", "Юрист", "Менеджер", "Стюардесса", "Режиссер", "Ивестор"],
        "b": ["Аналитик", "Специалист по международным отношениям", "Инженер", "Финансист", "Тренер"],
        "c": ["Бизнесмен", "Специалист по продажам", "Инструктор", "Дизайнер"],
        "d": ["Киберспортсмен", "Актер", "Рабочий"],
        }
    },

   "q7": {
        "text": "Какой стиль работы вам ближе?",
        "options": {"a": "Строгий и структурированый", "b": "Гибкий и свободный", "c": "Индивидуальный"},
        "professions": {
        "a": ["Юрист", "Директор", "Бухгалтер", "Оператор", "Дипломат"],
        "b": ["Дизайнер", "Художник", "Бизнесмен", "Музыкант", "Переводчик", "Блогер"],
        "c": ["Тренер", "Программист", "Исследователь", "Киберспортсмен"],
        }
        },
        "q8": {
        "text": "Как вы реагируете на изменения в рабочем процессе?",
        "options": {"a": "Легко адаптируюсь", "b": "Требуется время на привыкание", "c": "Не люблю изменения"},
        "professions": {
        "a": ["Менеджер", "Программист", "Тренер", "Гид", "Актер", "Специалист по  международным отношениям"],
        "b": ["Специалист по продажам", "Исследователь", "Финансист", "Учитель"],
        "c": ["Бухгалтер", "Оператор", "Врач"],
        }
     },
    "q9": {
        "text": "Какие хобби вам по душе?",
        "options": {"a": "Спортзал/активный отдых", "b": "Чтение/изучение нового", "c": "Творчество", "d":"Настольные игры", "e":"Путешествия"},
        "professions": {
        "a": ["Тренер", "Инструктор", "Спортсмен"],
        "b": ["Учитель", "Инженер", "Исследователь", "Врач"],
        "c": ["Дизайнер", "Актер", "Музыкант", "Художник", "Фотограф", "Режиссер", "Фотограф"],
        "d": ["Психолог", "Аналитик", "Учитель"],
        "e": ["Гид", "Журналист", "Стюардесса",],
        }
    },
        
    "q10": {
        "text": "Как вы относитесь к волонтерской работе?",
        "options": {"a": "Очень активно участвую", "b": "Время от времени", "c": "Не интересует"},
        "professions": {
        "a": ["Волонтер", "Психолог", "Социальный работник", "Организатор"],
        "b": ["Учитель", "Врач", "Консультант", "Зоолог"],
        "c": ["Режиссер", "Бухгалтер", "Программист", "Оператор"],
        }
    },

    "q11": {
        "text": "Как вы относитесь к инновациям и новым технологиям?",
        "options": {"a": "Всегда готов изучать", "b": "Иногда интересуюсь", "c": "Предпочитаю проверенные временем методы"},
        "professions": {
        "a": ["Инженер", "Программист", "Исследователь", "Разработчик", "Инвестор"],
        "b": ["Аналитик", "Менеджер", "Дизайнер", "Дипломат", "Финансист", "Юрист"],
        "c": ["Бухгалтер", "Оператор", "Рабочий", "Психолог", "Волонтер"],
        }
},
    "q12": {
        "text": "Как вы оцениваете свои лидерские качества?",
        "options": {"a": "Отлично", "b": "Хорошо", "c": "Плохо"},
        "professions": {
        "a": ["Бизнесмен", "Тренер", "Ведущий", "Директор", "Организатор"],
        "b": ["Актер", "Режиссер", "Психолог", "Менеджер", "HR-менеджер"],
        "c": ["Программист", "Консультант", "Учитель", "Бухгалтер", "Волонтер", "Переводчик", "Фотограф"],
        }
},
    "q13": {
        "text": "Как вы справляетесь со стрессом?",
        "options": {"a": "Умею контролировать эмоции", "b": "Немного волнуюсь", "c": "Использую физическую активность", "d": "Паникую"},
        "professions": {
        "a": ["Психолог", "Специалист по продажам", "Специалист по работе с клиентами", "Учитель", "HR-менеджер", "Врач", "Зоолог"],
        "b": ["Учитель", "Менеджер", "Фотограф", "Консультант"],
        "c": ["Тренер", "Спортсмен", "Инструктор", "Киберспортсмен"],
        "d": ["Водитель", "Оператор", "Кассир", "Рабочий"],
        }
        },
    "q14": {
        "text": "Как вы относитесь к рутине?",
        "options": {"a": "Ненавижу рутину", "b": "Устойчив к рутине", "c": "Рутину воспринимаю нейтрально", "d": "Работаю в рутине"},
        "professions": {
        "a": ["Журналист", "Режиссер", "Художник", "Зоолог", "Актер"],
        "b": ["Юрист", "Бухгалтер", "Режиссер", "Фотограф"],
        "c": ["Программист", "Инженер", "Менеджер", "Киберспортсмен"],
        "d": ["Водитель", "Кассир", "Охранник", "Бармен", "Водитель"],
        }
},
    "q15": {
        "text": "Какой тип ответственности вам ближе всего?",
        "options": {"a": "Высокий", "b": "Средний", "c": "Низкий"},
        "professions": {
        "a": ["Врач", "Юрист", "Директор", "Организатор", "Зоолог", "Инвестор", "Специалист по международным отношениям", "Стюардесса", "Разработчик"],
        "b": ["Учитель", "Водитель", "Менеджер", "Специалист по работе с клиентами"],
        "c": ["Кассир", "Охранник", "Консультант", "Блогер"],
        }
},
    "q16": {
        "text": "Что для вас важнее всего при выборе профессии?",
        "options": {"a": "Доброта, помощь", "b": "Интерес и увлечение", "c": "Деньги, обеспеченность", "d": "Возможность расти"},
        "professions": {
        "a": ["Врач", "Зоолог", "Психолог", "Учитель", "Социальный работник", "Волонтер"],
        "b": ["Музыкант", "Дизайнер", "Разработчик", "Писатель"],
        "c": ["Дипломат", "Бизнесмен", "Директор", "Инвестор", "Финансист"],
        "d": ["Менеджер", "Специалист по качеству", "Консультант", "Разработчик"],
        }
},
   "q17": {
        "text": "Как вы относитесь к обучению и саморазвитию?",
        "options": {"a": "Постоянно обучаюсь", "b": "Обучаюсь по мере необходимости", "c": "Не очень интересует"},
        "professions": {
        "a": ["Ученый", "Учитель", "Разработчик", "Инженер", "Врач"],
        "b": ["Программист", "Дизайнер", "Архитектор", "Водитель"],
        "c": ["Оператор", "Кассир", "Музыкант", "Рабочий"],
        }
   },
   "q18": {
        "text": "Какой тип работы вы предпочитаете?",
        "options": {"a": "Командную", "b": "Самостоятельную", "c": "Комбинированную", "d": "С клиентами"},
        "professions": {
        "a": ["Врач", "Учитель", "Менеджер", "Социальный работник", "Киберспортсмен"],
        "b": ["Программист", "Писатель", "Фотограф", "Разработчик", "Спортсмен"],
        "c": ["Аналитик", "HR-менеджер", "Актер", "Режиссер", "Специалист по качеству", "Инвестор"],
        "d": ["Бизнесмен", "Психолог", "Волонтер", "Врач", "HR-Менеджер", "Юрист", "Финансист", "Специалист по международным отношениям", "Переводчик"],
        }
    },
   "q19": {
        "text": "Как вы относитесь к вызовам в вашей профессии?",
        "options": {"a": "Обожаю сталкиваться с ними", "b": "Нормально, если чувствую их полезными", "c": "Я их избегаю"},
        "professions": {
        "a": ["Юрист", "Ученый", "Аналитик", "Менеджер"],
        "b": ["Директор", "Бизнесмен", "Специалист по международным отношениям", "Дизайнер"],
        "c": ["Учитель", "Психолог", "Зоолог", "Социальный работник"],
        }
    },

    "q19": {
        "text": "Как вы относитесь к нормам и правилам?",
        "options": {"a": "Всегда и везде соблюдаю", "b": "Нормально, но иногда их перекручиваю", "c": "Не всегда принимаю во внимание"},
        "professions": {
        "a": ["Юрист", "Финансист", "Инвестор", "Специалист по качеству"],
        "b": ["Аналитик", "Директор", "Бизнесмен", "Программист", "HR-менеджер"],
        "c": ["Инженер", "Музыкант", "Актер", "Исследователь"],
        }
},
    "q20": {
        "text": "Насколько вы уверены в своих силах?",
        "options": {"a": "Уверен", "b": "Средне уверен", "c": "Не уверен"},
        "professions": {
        "a": ["Инвестор", "Бизнесмен", "Специалист по продажам", "Актер", "Психолог", "Менеджер", "Ведущий", "Организатор", "Политик"],
        "b": ["Учитель", "Финансист", "Инженер", "Программист"],
        "c": ["Бармен", "Оператор", "Рабочий"],
        }
        },
    "q21": {
        "text": "Как вы предпочитаете получать информацию?",
        "options": {"a": "Визуально", "b": "Аудиально", "b": "Практически", "d": "Чтением"},
        "professions": {
        "a": ["Дизайнер", "Фотограф", "Архитектор", "Художник"],
        "b": ["Музыкант", "Учитель", "Актер"],
        "c": ["Инженер", "Разработчик", "Врач", "Зоолог"],
        "d": ["Психолог", "Писатель", "Библиотекарь"],
        }
},
    "q22": {
        "text": "Какой темп работы вы предпочитаете?",
        "options": {"a": "Быстрый", "b": "Нормальный", "c": "Медленный", "d": ""},
        "professions": {
        "a": ["Журналист", "Менеджер", "Актер", "Блогер", "Режиссер"],
        "b": ["Аналитик", "Юрист", "Специалист по качеству", "Специалист по международным отношениям"],
        "c": ["Рабочий", "Ученый", "Писатель", "Разработчик", "Библиотекарь"],
        "d": ["Инженер", "Социальный работник", "Врач", "Зоолог", "Фотограф", "организатор"],
        }
},
    "q23": {
        "text": "Как вы относитесь к работе в многонациональной компании?",
        "options": {"a": "Мне это нравится", "b": "Нормально", "c": "Не люблю"},
        "professions": {
        "a": ["Менеджер по международным отношениям", "Дипломат", "Гид"],
        
        "b": ["Программист", "Аналитик", "Дизайнер", "Специалист по продажам"],
        "c": ["Исследователь", "Музыкант", "Оператор", "Художник"],
        }
},
    "q24": {
        "text": "Как вы предпочитаете решать проблемы?",
        "options": {"a": "Анализируя каждую деталь", "b": "Интуитивно", "c": "Консультируясю с другими", "d": "Я отказываюсь решать"},
        "professions": {
        "a": ["Аналитик", "Ученый", "Инженер", "Специалист по качеству"],
        "b": ["Психолог", "Дизайнер", "Менеджер", "Директор"],
        "c": ["Социальный работник", "Учитель", "Тренер", "HR-менеджер", "Блогер"],
        "d": ["Оператор", "Кассир", "Бармен", "Рабочий"],
        }
},
    "q25": {
        "text": "Как вы относитесь к критике своих идей?",
        "options": {"a": "Принимаю ее с благодарностью", "b": "Оцениваю конструктивно", "": "Чувствую себя некомфортно", "": "Отклоняю критику"},
        "professions": {
        "a": ["Психолог", "Менеджер", "Ученый", "Консультант", "Инженер", "Юрист"],
        "b": ["Дизайнер", "Программист", "Архитектор", "Аналитик"],
        "c": ["Художник", "Писатель", "Музыкант", "Исследователь"],
        "d": ["Политик", "Актер", "Тренер", "Блогер"],
    }     
  },
}

@app.route("/", methods=["GET", "POST"])
def test():
    if request.method == "POST":
        answers_user = {}
        suggested_professions = []
	    
        for question_key in questions:
            user_answer = request.form.get(question_key)
            if user_answer:
		    answers_user[question_key] = user_answer
                if user_answer in questions[question_key]["professions"]:
                    suggested_professions.extend(questions[question_key]["professions"][user_answer])
            if not suggested_professions:
		    return redirect(url_for('results', professions=[]))

        profession_counts = Counter(suggested_professions)
        sorted_professions_with_counts = profession_counts.most_common(5)
	    top_professions_names = [prof[0] for prof in sorted_professions_with_counts] 

        return redirect(url_for('results', professions=top_professions_names))

    question_keys = list(questions.keys())
    random.shuffle(question_keys)
    return render_template("test.html", questions=questions, question_keys=question_keys)
	
@app.route("/results")
def results():
	professions_from_url = request.args.getlist('professions')
    return render_template("results.html", professions_data=professions_from_url)

if __name__ == "__main__":
    app.run(debug=True)
